---
kind: property
id: P:Autodesk.Revit.DB.ConicalSurface.Axis
zh: 轴、x轴、y轴、z轴
source: html/a50b1b88-0918-cb30-b5f8-84e1f1d2dd6c.htm
---
# Autodesk.Revit.DB.ConicalSurface.Axis Property

**中文**: 轴、x轴、y轴、z轴

Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.

## Syntax (C#)
```csharp
public XYZ Axis { get; }
```